# merge dataframe

In [4]:
import pandas as pd
df1={
    "city":["newyork","chicago","orlando"],
    "temperature":[21,14,35]
    
}
df1=pd.DataFrame(df1)
df1

      city  temperature
0  newyork           21
1  chicago           14
2  orlando           35

In [8]:
df2={
    "city":["chicago","new york","orlando"],
    "humidity":[65,68,75]
    
}
df2=pd.DataFrame(df2)
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [9]:

df3=pd.merge(df1,df2,on="city")
df3

      city  temperature  humidity
0  chicago           14        65
1  orlando           35        75